PANDAS - (Pannel Data Analysis)
-
It is the Library of "PYTHON" Data Analysis USED when Data Manipulation., Cleaning work on data.

DATA Manipulation

Process of changing data to make it more organised and readable.

Pandas has two data struture

1-Series

2-DataFrame (Tbales)

Creating Series
Pnada series is a one-dimensional labeled array capabel of hloding nay data type. However, a series is a sequence of homogeneous data types, similar to an array, or column in a table.

In [78]:
import pandas as pd
#import seaborn as sns

In [79]:
#creating a series with arbitarary lsit
s=pd.Series([123,456,'FRANCE',25,"WEATHER"])
s

0        123
1        456
2     FRANCE
3         25
4    WEATHER
dtype: object

Creating Our First Pandas DataFrame
-

In [ ]:
df = pd.DataFrame()

In [81]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [82]:
df1 = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],columns=['A1','A2','A3'])

In [83]:
df1.shape

(3, 3)

In [84]:
df1

   A1  A2  A3
0   1   2   3
1   4   5   6
2   7   8   9

In [85]:
df1.describe()

        A1   A2   A3
count  3.0  3.0  3.0
mean   4.0  5.0  6.0
std    3.0  3.0  3.0
min    1.0  2.0  3.0
25%    2.5  3.5  4.5
50%    4.0  5.0  6.0
75%    5.5  6.5  7.5
max    7.0  8.0  9.0

In [86]:
df1.head(2)  # will print only two rows from header

   A1  A2  A3
0   1   2   3
1   4   5   6

In [87]:
df1.tail(2)

   A1  A2  A3
1   4   5   6
2   7   8   9

In [88]:
type(df1)

pandas.core.frame.DataFrame

In [89]:
df1.dtypes

A1    int64
A2    int64
A3    int64
dtype: object

In [90]:
df1.dtypes=="object"

A1    False
A2    False
A3    False
dtype: bool

In [91]:
df1.dtypes[df1.dtypes=="object"]

Series([], dtype: object)

In [92]:
df1.columns

Index(['A1', 'A2', 'A3'], dtype='object')

In [93]:
df1[2:3]

   A1  A2  A3
2   7   8   9

In [94]:
df1.A2

0    2
1    5
2    8
Name: A2, dtype: int64

Reading a CVS file in python
-

Creating an Excel File

In [95]:
ship = sns.load_dataset("titanic")
ship

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [96]:

ship.to_excel("./ship.xlsx")

Creaitng a CSV File

In [97]:
ship.to_csv("./ship.csv")

Reading a CSV File

In [98]:
df = pd.read_csv("ship.csv")

In [99]:
df

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [100]:
print(df['survived'])

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: survived, Length: 891, dtype: int64

Reading an Excel File

In [101]:
pd.read_excel("ship.xlsx")

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

Write a CSV File
-

In [102]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],columns=['A1','A2','A3'])

In [103]:
df.to_csv("export.csv")

In [104]:
pd.read_csv("export.csv")

   Unnamed: 0  A1  A2  A3
0           0   1   2   3
1           1   4   5   6
2           2   7   8   9

DataFrame Merging
-

In [105]:
d1 = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],columns=['A1','A2','A3'])
d1

   A1  A2  A3
0   1   2   3
1   4   5   6
2   7   8   9

In [106]:
d2 = pd.DataFrame([[11,22,33],[44,55,66],[77,88,99]],columns=['X','Y','Z'])
d2

    X   Y   Z
0  11  22  33
1  44  55  66
2  77  88  99